app/controllers/user_controller.rb

INSERT INTO "users" ("username", "favourite_language", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "PianoFF"], ["favourite_language", "JavaScript"], ["created_at", "2020-03-11 11:59:03.892047"], ["updated_at", "2020-03-11 11:59:03.892047"]]
---
    def create
        @user = User.new(user_params)

        @user.favourite_language = @user.favourite_programming_language(@user.username)

        if @user.save